Revit 2027 API
Space.IsPointInSpace Method
Determines if a point lies within the volume of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPointInSpace(
	XYZ point
)
Public Function IsPointInSpace (
	point As XYZ
) As Boolean
public:
bool IsPointInSpace(
	XYZ^ point
)
member IsPointInSpace :
        point : XYZ -> bool
Parameters
point XYZ
Point to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the point is null.
ArgumentException |  The coordinates of the point is not a number.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace